{
    "scenarios": [
        {
            "id": 1,
            "title": "Titanium Forging Temperature Control",
            "paragraphs": [
                "You are working at a titanium forging plant where precise temperature control is critical for the material properties of the final product.",
                "The operators have reported that the temperature control system has been behaving erratically over the past shift.",
                "Initial investigation shows that the PID controller output seems to be oscillating more than usual, and the temperature is not maintaining steady state.",
                "The system was working perfectly fine last week, and no changes have been made to the PID parameters."
            ],
            "image": "titanium-forge.svg",
            "questions": [
                {
                    "id": "1.1",
                    "text": "What are the potential causes of the oscillating behavior in the temperature control system?",
                    "type": "text",
                    "placeholder": "List potential causes..."
                },
                {
                    "id": "1.2",
                    "text": "Which components would you check first and why?",
                    "type": "text",
                    "placeholder": "Describe your initial troubleshooting steps..."
                },
                {
                    "id": "1.3",
                    "text": "How would you verify if the thermocouple is functioning correctly?",
                    "type": "text",
                    "placeholder": "Explain your verification process..."
                }
            ]
        },
        {
            "id": 2,
            "title": "Pharmaceutical Clean Room HVAC",
            "paragraphs": [
                "A pharmaceutical plant's clean room temperature control system is showing signs of deviation from setpoint.",
                "The facility manager has noticed that the temperature is gradually rising above setpoint during peak production hours.",
                "The clean room must maintain a temperature of 20°C ±0.5°C for product quality.",
                "The system uses a water-cooled chiller with redundant pumps.",
                "Maintenance logs show all preventive maintenance is up to date."
            ],
            "image": "pharma-cleanroom.svg",
            "questions": [
                {
                    "id": "2.1",
                    "text": "What could be causing the gradual temperature rise during peak hours?",
                    "type": "text",
                    "placeholder": "Consider all possible factors..."
                },
                {
                    "id": "2.2",
                    "text": "How would you determine if the issue is related to cooling capacity or control system?",
                    "type": "text",
                    "placeholder": "Explain your diagnostic approach..."
                },
                {
                    "id": "2.3",
                    "text": "What data would you collect to troubleshoot this issue?",
                    "type": "text",
                    "placeholder": "List the key parameters..."
                }
            ]
        },
        {
            "id": 3,
            "title": "CNC Machines Factory Cooling",
            "paragraphs": [
                "You're called to investigate a CNC machining facility where multiple machines are reporting spindle temperature warnings.",
                "The central coolant system that supplies all CNC machines shows normal pressure readings.",
                "Operators report that the issue started gradually over the past month.",
                "The facility recently increased production hours from 8 to 24 hours per day.",
                "Temperature logs show higher than normal readings during the night shift."
            ],
            "image": "cnc-cooling.svg",
            "questions": [
                {
                    "id": "3.1",
                    "text": "Why might the temperature issues be more prominent during night shift?",
                    "type": "text",
                    "placeholder": "Consider environmental and operational factors..."
                },
                {
                    "id": "3.2",
                    "text": "What maintenance checks would you perform on the central coolant system?",
                    "type": "text",
                    "placeholder": "List specific checks and measurements..."
                },
                {
                    "id": "3.3",
                    "text": "How would you verify if the coolant flow is adequate for 24-hour operation?",
                    "type": "text",
                    "placeholder": "Describe your testing approach..."
                }
            ]
        },
        {
            "id": 4,
            "title": "Server Room Temperature Control",
            "paragraphs": [
                "A marketing company's server room cooling system has triggered multiple high-temperature alarms.",
                "The building management system shows the HVAC is running at maximum capacity.",
                "IT staff report that several new high-performance servers were installed last week.",
                "The room temperature sensors show uneven readings across different areas.",
                "Some server racks are showing significantly higher intake temperatures than others."
            ],
            "image": "server-room.svg",
            "questions": [
                {
                    "id": "4.1",
                    "text": "What immediate steps would you take to protect the server equipment?",
                    "type": "text",
                    "placeholder": "List immediate actions..."
                },
                {
                    "id": "4.2",
                    "text": "How would you investigate the uneven temperature distribution?",
                    "type": "text",
                    "placeholder": "Describe your investigation process..."
                },
                {
                    "id": "4.3",
                    "text": "What long-term solutions would you propose to prevent this issue?",
                    "type": "text",
                    "placeholder": "List potential solutions..."
                }
            ]
        },
        {
            "id": 5,
            "title": "Potash Mine Brine System",
            "paragraphs": [
                "At a potash mine, the brine injection system's flow control loop is showing inconsistent behavior.",
                "Operators report that the flow rate fluctuates despite a constant setpoint.",
                "The control valve position indicator shows frequent movement.",
                "Pressure sensors upstream and downstream of the control valve show stable readings.",
                "The issue appears to be worse when the brine temperature is higher."
            ],
            "image": "brine-system.svg",
            "questions": [
                {
                    "id": "5.1",
                    "text": "Why might the valve position be constantly changing?",
                    "type": "text",
                    "placeholder": "List possible causes..."
                },
                {
                    "id": "5.2",
                    "text": "How does brine temperature affect the control system?",
                    "type": "text",
                    "placeholder": "Explain the relationship..."
                },
                {
                    "id": "5.3",
                    "text": "What maintenance procedures would you recommend?",
                    "type": "text",
                    "placeholder": "Detail your maintenance plan..."
                }
            ]
        },
        {
            "id": 6,
            "title": "Food Processing Sterilizer",
            "paragraphs": [
                "You've just started as a maintenance technician at a food processing plant.",
                "During your first day, an operator reports that the steam sterilization system isn't reaching temperature.",
                "The system should maintain 121°C for sterilization, but it's only reaching 115°C.",
                "The steam pressure gauge shows normal supply pressure.",
                "You notice the temperature controller display occasionally flickers."
            ],
            "image": "sterilizer.svg",
            "questions": [
                {
                    "id": "6.1",
                    "text": "What safety considerations should you keep in mind when troubleshooting?",
                    "type": "text",
                    "placeholder": "List safety precautions..."
                },
                {
                    "id": "6.2",
                    "text": "What could cause the temperature controller display to flicker?",
                    "type": "text",
                    "placeholder": "Consider possible causes..."
                },
                {
                    "id": "6.3",
                    "text": "How would you systematically troubleshoot this issue?",
                    "type": "text",
                    "placeholder": "Outline your troubleshooting steps..."
                }
            ]
        },
        {
            "id": 7,
            "title": "Injection Molding Temperature",
            "paragraphs": [
                "A plastic injection molding machine is producing parts with inconsistent quality.",
                "The mold temperature control unit shows the temperature is within specification.",
                "Quality control reports that parts from certain cavities are showing signs of incomplete filling.",
                "The issue seems to be more pronounced during longer production runs.",
                "Historical data shows gradual degradation in temperature uniformity."
            ],
            "image": "injection-mold.svg",
            "questions": [
                {
                    "id": "7.1",
                    "text": "Why might some cavities be affected more than others?",
                    "type": "text",
                    "placeholder": "Consider thermal distribution factors..."
                },
                {
                    "id": "7.2",
                    "text": "What could cause temperature non-uniformity despite control readings being normal?",
                    "type": "text",
                    "placeholder": "List potential causes..."
                },
                {
                    "id": "7.3",
                    "text": "How would you verify the actual mold temperature distribution?",
                    "type": "text",
                    "placeholder": "Describe your testing approach..."
                }
            ]
        },
        {
            "id": 8,
            "title": "Chemical Reactor pH Control",
            "paragraphs": [
                "A chemical processing plant is experiencing issues with pH control in a continuous reactor.",
                "The pH readings are showing more variation than usual, affecting product quality.",
                "The control system appears to be responding slower than normal to pH deviations.",
                "Calibration records show the pH probe was replaced last month.",
                "The issue seems worse when processing certain product grades."
            ],
            "image": "ph-control.svg",
            "questions": [
                {
                    "id": "8.1",
                    "text": "What could cause the slower response time in the pH control system?",
                    "type": "text",
                    "placeholder": "List potential causes..."
                },
                {
                    "id": "8.2",
                    "text": "How would you verify if the new pH probe is functioning correctly?",
                    "type": "text",
                    "placeholder": "Describe verification steps..."
                },
                {
                    "id": "8.3",
                    "text": "What maintenance procedures would you recommend for the pH control system?",
                    "type": "text",
                    "placeholder": "Detail maintenance steps..."
                }
            ]
        }
    ]
} 